#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.trend-getter-key: Refreshing state... [id=a47ca5ce69932d82542644f179386827027c4e11]
data.aws_subnet.public_1: Reading...
data.aws_iam_policy_document.lambda_role: Reading...
aws_key_pair.trend-getter-ec2-key: Refreshing state... [id=c18-trend-getter-kp]
aws_ecr_repository.c18-trend-getter-dashboard-ecr: Refreshing state... [id=c18-trend-getter-dashboard-ecr]
data.aws_iam_policy_document.lambda_role_notif: Reading...
aws_ecr_repository.c18-trend-getter-notifications-ecr: Refreshing state... [id=c18-trend-getter-notifications-ecr]
aws_iam_role.eventbridge_invoke_stepfunction_role: Refreshing state... [id=c18-tg-event-sm-role]
aws_iam_role.step_function_role: Refreshing state... [id=step-function-execution-role]
aws_s3_bucket.c18-trend-getter-s3: Refreshing state... [id=c18-trend-getter-s3]
data.aws_iam_policy_document.lambda_role_notif: Read complete after 0s [id=2690255455]
data.aws_iam_policy_document.lambda_permissions: Reading...
data.aws_iam_policy_document.lambda_role: Read complete after 0s [id=3917546067]
data.aws_iam_policy_document.lambda_permissions_notif: Reading...
data.aws_subnet.public_2: Reading...
data.aws_iam_policy_document.lambda_permissions: Read complete after 0s [id=1274356838]
data.aws_iam_policy_document.lambda_permissions_notif: Read complete after 0s [id=2637988731]
data.aws_subnet.public_3: Reading...
aws_cloudwatch_event_rule.s3_put_event: Refreshing state... [id=trigger-stepfunction-on-upload]
data.aws_vpc.main: Reading...
aws_iam_policy.step_function_policy: Refreshing state... [id=arn:aws:iam::129033205317:policy/step-function-lambda-invoke-policy]
aws_ecr_repository.trend-getter-extract-and-load-ecr: Refreshing state... [id=trend-getter-extract-and-load-ecr]
aws_ecr_repository.trend-getter-lambda-ecr: Refreshing state... [id=trend-getter-lambda-ecr]
aws_iam_role.lambda_role_notif: Refreshing state... [id=c18-data-getter-notif-lambda-role]
data.aws_subnet.public_3: Read complete after 1s [id=subnet-0aed07ac008a10da9]
aws_iam_role.lambda_role: Refreshing state... [id=c18-data-getter-lambda-role]
data.aws_subnet.public_1: Read complete after 1s [id=subnet-0679d4b1f9e7839ef]
aws_iam_policy.lambda_s3_policy: Refreshing state... [id=arn:aws:iam::129033205317:policy/c18-data-getter-lambda-s3-policy]
data.aws_subnet.public_2: Read complete after 1s [id=subnet-0f10662561eade8c3]
aws_iam_role_policy_attachment.step_function_attach_policy: Refreshing state... [id=step-function-execution-role/arn:aws:iam::129033205317:policy/step-function-lambda-invoke-policy]
aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=c18-trend-getter-rds-subnet-group]
aws_lambda_function.lambda_function_notif: Refreshing state... [id=c18-trend-getter-notifications-function]
aws_iam_role_policy_attachment.lambda_s3_attach: Refreshing state... [id=c18-data-getter-lambda-role/arn:aws:iam::129033205317:policy/c18-data-getter-lambda-s3-policy]
aws_lambda_function.lambda_function: Refreshing state... [id=c18-trend-getter-lambda-function]
data.aws_vpc.main: Read complete after 0s [id=vpc-0adcb6a62ca552c01]
aws_security_group.rds_sg: Refreshing state... [id=sg-0699c97d0de8afddc]
aws_security_group.trend-getter-ec2-sg: Refreshing state... [id=sg-0ec95d6742c91e9bb]
aws_lambda_permission.allow_lambda: Refreshing state... [id=AllowExecutionFromETLLambda]
aws_sfn_state_machine.etl_sm: Refreshing state... [id=arn:aws:states:eu-west-2:129033205317:stateMachine:c18-trendgetter-etl-notif-sm]
aws_instance.ec2: Refreshing state... [id=i-034fe5b94adc3d579]
aws_db_instance.postgresql: Refreshing state... [id=db-UU2R632XBCS7PYO2UOF2LKE3AE]
aws_s3_bucket_notification.s3_eventbridge: Refreshing state... [id=c18-trend-getter-s3]
aws_lambda_permission.allow_s3: Refreshing state... [id=AllowExecutionFromS3]
aws_iam_policy.eventbridge_invoke_stepfunction_policy: Refreshing state... [id=arn:aws:iam::129033205317:policy/c18-tg-event-policy]
aws_cloudwatch_event_target.trigger_stepfunction: Refreshing state... [id=trigger-stepfunction-on-upload-terraform-20250807171207781800000002]
aws_s3_bucket_notification.s3_trigger: Refreshing state... [id=c18-trend-getter-s3]
aws_iam_role_policy_attachment.attach_eventbridge_invoke_stepfunction: Refreshing state... [id=c18-tg-event-sm-role/arn:aws:iam::129033205317:policy/c18-tg-event-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecr_repository.c18-trend-getter-bsky-bot-ecr will be created
  + resource "aws_ecr_repository" "c18-trend-getter-bsky-bot-ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "c18-trend-getter-bsky-bot-ecr"
      + region               = "eu-west-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "c18-trend-getter-lambda-function"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DB_HOST"     = "c18trendgetterrds.c57vkec7dkkx.eu-west-2.rds.amazonaws.com" -> null
              ~ "DB_NAME"     = "trendgetterdb" -> null
              ~ "DB_PORT"     = "5432" -> null
                # (4 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_notification.s3_eventbridge will be updated in-place
  ~ resource "aws_s3_bucket_notification" "s3_eventbridge" {
      ~ eventbridge = false -> true
        id          = "c18-trend-getter-s3"
        # (2 unchanged attributes hidden)

      - lambda_function {
          - events              = [
              - "s3:ObjectCreated:*",
            ] -> null
          - id                  = "tf-s3-lambda-20250807171206941000000001" -> null
          - lambda_function_arn = "arn:aws:lambda:eu-west-2:129033205317:function:c18-trend-getter-lambda-function" -> null
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @jacoblewis046, Action: `pull_request`*